# 01. Importing Libraries

In [27]:
import pandas as pd
import numpy as np 
import os

# 02. Importing Data

In [28]:
# Creating a path to project folder

path = r'C:\Users\TanaT\(CF) Achievement 4 - Instacart Basket Analysis'

In [29]:
# Importing products data as a dataframe

df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [30]:
# Importing wrangled orders data as a dataframe

df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# 03. Data Consistency Checks on Products Data

## Mixed-Typed Columns

In [31]:
# Making a test dataframe with a mixed-typed column.

df_test = pd.DataFrame()

In [32]:
# Creating a mixed-type column.

df_test['mix']=['a', 'b', 1, True]

In [33]:
# Checking dataframe.

df_test.head()

    mix
0     a
1     b
2     1
3  True

In [34]:
# Creating a custom function to check whether the dataframe contains any mixed-type columns.

for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [35]:
# Found the mixed-typed column ('mix'), now fixing the column by changing its data type. 
## Changing data type from integer to string (object).

df_test['mix']=df_test['mix'].astype('str')

In [36]:
# Checking data type of 'mix' column.
df_test['mix'].dtype

dtype('O')

## Finding and Addressing Missing Values in Products Data

In [37]:
# Finding missing values in the products data.

df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [38]:
# There are 16 missing values in 'product_name' column. 
## Making a new dataframe that only contains those missing values (making a subset).

df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [39]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [40]:
# Addressing the missing values
## For this column 'product_name', it is a string, so imputation cannot be used.
## Before making any changes - checking the number of rows the dataframe currently has

df_prods.shape

(49693, 5)

In [41]:
# Will filter out the missing values - making a new dataframe that does not contain any missing (NaN) values

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [42]:
# Checking cleaned dataframe (should have 16 less rows).

df_prods_clean.shape

(49677, 5)

## Finding and Addressing Duplicates

In [43]:
# Finding full duplicates (having multiple rows with the same exact values in every column).
## Making new dataframe (df_dups) that will show all of the duplicate rows in the df_prods_clean dataframe. 

df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [44]:
# Checking the duplicates found. There are 5. 
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [45]:
# First checking the number of rows prior to deleting the duplicate rows.

df_prods_clean.shape

(49677, 5)

In [46]:
# Now deleting the duplicates and making a dataframe/new subset that does not contain any duplicates.

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [47]:
# Checking number of rows after deleting duplicates. There are 5 less rows. 

df_prods_clean_no_dups.shape

(49672, 5)

# 04. (Task) Data Consistency Checks on Wrangled Orders Data

In [51]:
# Step 2 - Run df.describe() on df_ords dataframe and share whether anything about the data looks off or should be investigated further.

df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

Observations: 

- I don't know what the first 'Unnamed: 0' column is.
- There seems to be 206,209 users based on the max 'user_id' number, if user id's are assigned in order (or they could be random). 
- The days of the week range from 0-6 and the center (50th percentile) is 3. There doesn't seem to be any irregularities in this column.
- There are no negative hours and the maximum hour is below 24, so there doesn't appear to be any irregularities in this column.
- For 'days_since_prior_order' colmun, the min is 0 and max is 30, meaning the middle should be about 15, but it is 7, so there may be an issue. 
- Max 'order_number' is 100 and min is 1, but the middle is 11, which is much lower than expected.
  This max order number could be an outlier and skew the data.

In [52]:
# Step 3 - Check for mixed-type data in df_ords dataframe.

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

Observation:
There were no mixed-type columns found in the df_ords dataframe.

In [54]:
# Step 5 - Run a check for missing values in the df_ords dataframe. Report findings in a markdown cell and propose an explanation for missing values.

## Checking for missing values

df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

Obervations:

- There are 206,209 missing values in the 'days_since_prior_order' column.
- There are no missing values for all other columns.

Explanation:

There may be missing values for this column due to logging gaps.
More likely, there are missing values, because it is counting first time orders as missing, since a first time order would have no prior data.

In [58]:
# Before making any changes - checking if the missing values happen during a user's first order ('order_number' should be 1).

## Making a new dataframe of orders to only include missing values.

df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [59]:
df_ords_nan

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [63]:
# Checking if the 'order_number' for all missing (NaN) values in the df_ords_nan dataframe are indeed 1.

df_ords_nan['order_number'].describe()

count    206209.0
mean          1.0
std           0.0
min           1.0
25%           1.0
50%           1.0
75%           1.0
max           1.0
Name: order_number, dtype: float64

- 'order_number' column contains '1' for the corresponding missing values found in 'days_since_prior_order' column. 
- This seems to show that the missing values in 'days_since_prior_order' correspond to the first order placed for each user.
- There are the same number of missing values as there are users (206,209), so it makes sense that every user has a missing value to represent their first order placed.

In [64]:
# Step 6 - Address the missing values using an appropriate method.
## Going to leave the missing values, because they aren't actually "missing", they represent a feature of the data.

In [65]:
# Step 7 - Run a check for duplicates in the df_ords data. In a markdown cell, report findings and give an explanation for any duplicates found.
## Finding full duplicates and making a new dataframe that only contains duplicates found.

df_ords_dups = df_ords[df_ords.duplicated()]

In [66]:
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

Obervation: No duplicates in the df_ords dataframe found.

In [67]:
# Step 8 - Address the duplicates using an appropriate method and explain method of choice. 
## No duplicates were found in df_ords dataframe, so no changes will be made.

# Additional Cleaning

In [73]:
# Additional cleaning - seems like the 'Unnamed: 0' column is a duplicate of the index column and could be dropped.

df_ords

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0
3421079,3421079,1854736,206209,11,4,10,30.0
3421080,3421080,626363,206209,12,1,12,18.0
3421081,3421081,2977660,206209,13,1,12,7.0
3421082,3421082,272231,206209,14,6,14,30.0

In [74]:
## Dropping the column and making a new dataframe (df_ords_clean)

df_ords_clean = df_ords.drop(columns=['Unnamed: 0'])

In [77]:
# Checking cleaned orders data

df_ords_clean.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

# Exporting Data

In [78]:
# Exporting cleaned and prepped products data. 

df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'cleaned_products_data.csv'))

In [79]:
# Exporting cleaned and prepped orders data. 

df_ords_clean.to_csv(os.path.join(path, '02 Data','Prepared Data', 'cleaned_orders_data.csv'))